#include <stdio.h>
#include "board.h"
#include guard

unsigned short int board[8][8] = {{21, 22, 23, 24, 25, 23, 22, 21},
								  {20, 20, 20, 20, 20, 20, 20, 20},
								  {0, 0, 0, 0, 0, 0, 0, 0},
								  {0, 0, 0, 0, 0, 0, 0, 0},
								  {0, 0, 0, 0, 0, 0, 0, 0},
								  {0, 0, 0, 0, 0, 0, 0, 0},
								  {10, 10, 10, 10, 10, 10, 10, 10},
								  {11, 12, 13, 14, 15, 13, 12, 11}};


int main()
{
	FILE *log;
	log = fopen("./logs/user.log", "w");
	fclose(log);
	printf("Добро пожаловать в шахматы. Введите '1' если хотите играть; если хотите отменить игру, введите любое число\n");
	char i1[3], j1[3];
	unsigned short int i2, j2;
	int a;
	scanf("%d", &a);
	while (a == 1) {
		printf("Выберите фигуру\n");
		scanf("%s", &i1[0]);
		while ((i1[0] < 'a') || (i1[0] > 'h')) {
			printf("Ошибка ввода,повторите попытку\n");
			scanf("%s", &i1[0]);
		}
		scanf("%s", &j1[0]);
		while ((j1[0] < '1') || (j1[0] > '8')) {
			printf("Ошибка ввода,повторите попытку\n");
			scanf("%s", &j1[0]);
		}
		
		i2 = table_1(i1[0]);//Преобразование символа в число
		j2 = table_2(j1[0]);//Преобразование символа в число
		log = fopen("./logs/user.log", "a+");
		fprintf(log, "%c%c%c",code_to_letter(j2, i2), i1[0], j1[0]);
		fclose(log);
		print_board();
		board_(j2, i2);//Вызов основной функции
		print_board();
		printf("Для продолжения введите '1' если хотите играть,если хотите отменить игру, введите любое число ");
		scanf("%d", &a);
	}
	return 0;
}
